Catalogs/Приоритеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Приоритеты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БольшаяКартинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоЗадач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗадачУКонструктора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МалаяКартинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Приоритеты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДобавитьБольшуюКартинку(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМаленькуюКартинку(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		ЦветФона 	= Новый Цвет(255, 255, 255);
		ЦветТекста 	= Новый Цвет(0, 0, 0);
	Иначе	
		ЦветФона 	= омЦвет.ПолучитьЦветИзСтрокиСПрефиксом(Объект.ЦветФона);
		ЦветТекста 	= омЦвет.ПолучитьЦветИзСтрокиСПрефиксом(Объект.ЦветТекста);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Декорация1.ЦветТекста 	= ЦветТекста;
	Элементы.Декорация1.ЦветФона 	= ЦветФона;
	ПодключитьОбработчикОжидания("ПослеЗагрузкиКартинки", 0.5, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаПриИзменении(Элемент)
	Элементы.Декорация1.ЦветФона 	= ЦветФона;
	Модифицированность 				= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЦветШрифтаПриИзменении(Элемент)
	Элементы.Декорация1.ЦветТекста 	= ЦветТекста;
	Модифицированность 				= Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЦветФона = омЦвет.ПолучитьСтроковоеПредставлениеЦвета(ЦветФона);
	ТекущийОбъект.ЦветТекста = омЦвет.ПолучитьСтроковоеПредставлениеЦвета(ЦветТекста);
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиМаленькойПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиМаленькойПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ПослеПеретаскиваняКартинки(ПараметрыПеретаскивания, "Маленькая");

КонецПроцедуры  

&НаКлиенте
Асинх Функция ПослеПеретаскиваняКартинки(ПараметрыПеретаскивания, ТипКартинки)

	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.Параметры.Ключ.Пустая() Тогда
		ПоказатьПредупреждение(,"Перед добавлением картинки необходимо сохранить изделие.");
		Возврат Ложь;	
	КонецЕсли;
	
	Если НЕ ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СсылкаНаФайл") Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	мДопустимоеРасширениеФайлов = Новый Массив(3);
	мДопустимоеРасширениеФайлов[0] = ".png";
	мДопустимоеРасширениеФайлов[1] = ".jpg";
	мДопустимоеРасширениеФайлов[2] = ".jpeg";
	
	ПолноеИмя = ПараметрыПеретаскивания.Значение.Файл.ПолноеИмя;
	ФайлКартинки = Новый Файл(ПолноеИмя);
	РасширениеФайла = НРег(ФайлКартинки.Расширение);
	Если мДопустимоеРасширениеФайлов.Найти(РасширениеФайла) = Неопределено Тогда
		
		СтрокаДопустимыеФорматы = "";
		
		Для каждого х Из мДопустимоеРасширениеФайлов Цикл
		 	Если НЕ ПустаяСтрока(СтрокаДопустимыеФорматы) Тогда
				СтрокаДопустимыеФорматы = СтрокаДопустимыеФорматы + ", ";
			КонецЕсли;
			
			СтрокаДопустимыеФорматы = СтрокаДопустимыеФорматы + х;
		КонецЦикла;
		
		СтрокаДопустимыеФорматы = СтрокаДопустимыеФорматы + ".";
		
		ПоказатьПредупреждение(,"Не допустимый тип файла. Возможные варианты " + СтрокаДопустимыеФорматы);
		Возврат Ложь;
		
	КонецЕсли;

	
	РазмерФайла = Окр(ФайлКартинки.Размер() / (1024*1024),1);
	МаксимальныйРазмерФайла = Окр(ПолучитьМаксимальныйРазмерФайла() / (1024*1024),1);
	Если РазмерФайла > МаксимальныйРазмерФайла Тогда
		ПоказатьПредупреждение(,"Размер файла " + РазмерФайла + " Мб. Максимальный допустимый размер файла " + МаксимальныйРазмерФайла + "Мб.");
		Возврат Ложь;	
	КонецЕсли; 
	
	ПомещенныйФайл = Ждать ПоместитьФайлНаСерверАсинх(,,,ПолноеИмя);
	
	ЗаписатьФайлКартинкиНаСервере(ПомещенныйФайл.Адрес, ТипКартинки);
	
	ПодключитьОбработчикОжидания("ПослеЗагрузкиКартинки", 0.5, Истина);
	
КонецФункции // После()

&НаКлиенте
Процедура ПослеЗагрузкиКартинки() Экспорт

	ОбновитьКартинки();	
	Элементы.АдресКартинкиМаленькой.Обновить();
	Элементы.АдресКартинкиБольшой.Обновить();

КонецПроцедуры // ПослеЗагрузкиКартинки()

Функция ЗаписатьФайлКартинкиНаСервере(АдресВХ, ТипКартинки)

	об = Объект.Ссылка.ПолучитьОбъект(); 
	
	Если ТипКартинки = "Маленькая" Тогда
		об.МалаяКартинка = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХ));
	Иначе
		об.БольшаяКартинка = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХ));
	КонецЕсли;
	об.Записать();
	
	ЭтаФорма.Прочитать();
	Модифицированность = Ложь;
КонецФункции

Процедура ОбновитьКартинки()	
	АдресКартинкиМаленькой 	= ПолучитьНавигационнуюСсылку(Объект.Ссылка, "МалаяКартинка");
	АдресКартинкиБольшой 	= ПолучитьНавигационнуюСсылку(Объект.Ссылка, "БольшаяКартинка");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМаксимальныйРазмерФайла()

	Возврат РаботаСФайлами.МаксимальныйРазмерФайла();	

КонецФункции // ПолучитьМаксимальныйРазмерФайла()

&НаКлиенте
Процедура АдресКартинкиБольшойПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиБольшойПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ПослеПеретаскиваняКартинки(ПараметрыПеретаскивания, "Большая");	
КонецПроцедуры
